spec/fixtures/stripe/monthly_invoice_paid.json

{
  "object": {
    "id": "in_1KrcuGLJ9zG7aLW81UcphqH5",
    "object": "invoice",
    "account_country": "NL",
    "account_name": "Squeaky B.V.",
    "account_tax_ids": null,
    "amount_due": 3800,
    "amount_paid": 3800,
    "amount_remaining": 0,
    "application_fee_amount": null,
    "attempt_count": 1,
    "attempted": true,
    "auto_advance": false,
    "automatic_tax": {
      "enabled": false,
      "status": null
    },
    "billing_reason": "subscription_create",
    "charge": "ch_3KrcuGLJ9zG7aLW80086w84r",
    "collection_method": "charge_automatically",
    "created": 1650697044,
    "currency": "gbp",
    "custom_fields": null,
    "customer": "cus_LYkhU0zACd6T4T",
    "customer_address": null,
    "customer_email": "lewismonteith@gmail.com",
    "customer_name": "Lewis Monteith",
    "customer_phone": null,
    "customer_shipping": null,
    "customer_tax_exempt": "none",
    "customer_tax_ids": [],
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "discounts": [],
    "due_date": null,
    "ending_balance": 0,
    "footer": null,
    "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1KPOB2LJ9zG7aLW8/test_YWNjdF8xS1BPQjJMSjl6RzdhTFc4LF9MWWtQN3J0aGE1QkU4NnJaN2tTQ3NVc2g1akdHWnNRLDQxMjM3ODQ30200Tktqlnn9?s=ap",
    "invoice_pdf": "https://pay.stripe.com/invoice/acct_1KPOB2LJ9zG7aLW8/test_YWNjdF8xS1BPQjJMSjl6RzdhTFc4LF9MWWtQN3J0aGE1QkU4NnJaN2tTQ3NVc2g1akdHWnNRLDQxMjM3ODQ30200Tktqlnn9/pdf?s=ap",
    "last_finalization_error": null,
    "lines": {
      "object": "list",
      "data": [
        {
          "id": "il_1KrcuGLJ9zG7aLW8K2982HMR",
          "object": "line_item",
          "amount": 3800,
          "currency": "gbp",
          "description": "1 × Light (at £38.00 / month)",
          "discount_amounts": [],
          "discountable": true,
          "discounts": [],
          "livemode": false,
          "metadata": {},
          "period": {
            "end": 1653289044,
            "start": 1650697044
          },
          "plan": {
            "id": "price_1KPOV6LJ9zG7aLW852tqylTr",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 3800,
            "amount_decimal": "3800",
            "billing_scheme": "per_unit",
            "created": 1643968484,
            "currency": "gbp",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "nickname": null,
            "product": "prod_L5ZegDlpSjEhtj",
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "price": {
            "id": "price_1KPOV6LJ9zG7aLW852tqylTr",
            "object": "price",
            "active": true,
            "billing_scheme": "per_unit",
            "created": 1643968484,
            "currency": "gbp",
            "livemode": false,
            "lookup_key": null,
            "metadata": {},
            "nickname": null,
            "product": "prod_L5ZegDlpSjEhtj",
            "recurring": {
              "aggregate_usage": null,
              "interval": "month",
              "interval_count": 1,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "tax_behavior": "unspecified",
            "tiers_mode": null,
            "transform_quantity": null,
            "type": "recurring",
            "unit_amount": 3800,
            "unit_amount_decimal": "3800"
          },
          "proration": false,
          "proration_details": {
            "credited_items": null
          },
          "quantity": 1,
          "subscription": "sub_1KrcuGLJ9zG7aLW8ZewbpPxD",
          "subscription_item": "si_LYkPgX7UYKE1BW",
          "tax_amounts": [],
          "tax_rates": [],
          "type": "subscription"
        }
      ],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/invoices/in_1KrcuGLJ9zG7aLW81UcphqH5/lines"
    },
    "livemode": false,
    "metadata": {},
    "next_payment_attempt": null,
    "number": "42A5DE55-0025",
    "on_behalf_of": null,
    "paid": true,
    "paid_out_of_band": false,
    "payment_intent": "pi_3KrcuGLJ9zG7aLW80tbB1pZx",
    "payment_settings": {
      "payment_method_options": null,
      "payment_method_types": null
    },
    "period_end": 1650697044,
    "period_start": 1650697044,
    "post_payment_credit_notes_amount": 0,
    "pre_payment_credit_notes_amount": 0,
    "quote": null,
    "receipt_number": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "paid",
    "status_transitions": {
      "finalized_at": 1650697044,
      "marked_uncollectible_at": null,
      "paid_at": 1650697046,
      "voided_at": null
    },
    "subscription": "sub_1KrcuGLJ9zG7aLW8ZewbpPxD",
    "subtotal": 3800,
    "tax": null,
    "test_clock": null,
    "total": 3800,
    "total_discount_amounts": [],
    "total_tax_amounts": [],
    "transfer_data": null,
    "webhooks_delivered_at": null
  }
}